# Set-Up

In [1]:
import sqlite3
import pandas as pd

In [2]:
conn = sqlite3.connect('../data/data.db')
c = conn.cursor()

def execute_statement(statement):
    c.execute(statement)
    res = c.fetchall()
    column_names = [description[0] for description in c.description]
    return pd.DataFrame(res, columns=column_names)

# UNION
The UNION operator can be used to combine the results of two seperate SELECT statements, however the following conditions must be held:
 * Each SELECT statement must have the same number of columns
 * The columns must have similar datatypes
 * The columns must have the same order

The example below is used to get all species taxons that are held in either the cites or the LeicestershireBirds tables.

In [3]:
execute_statement('''SELECT DISTINCT Taxon FROM cites
                     UNION
                     SELECT DISTINCT Taxon FROM LeicestershireBirds''')

                       Taxon
0           Coloeus monedula
1              Spinus spinus
2          Abeillia abeillei
3           Acanthis cabaret
4           Acanthis flammea
...                      ...
2009             Xema sabini
2010       Xenoglaux loweryi
2011  Xipholena atropurpurea
2012      Zoothera monticola
2013   Zosterops palpebrosus

[2014 rows x 1 columns]

UNION ALL is a similar operator however it will produce duplicates, as shown below.

In [4]:
execute_statement('''SELECT DISTINCT Taxon FROM cites
                     UNION ALL
                     SELECT DISTINCT Taxon FROM LeicestershireBirds''')

                           Taxon
0                Nandayus nenday
1     Psittacus erithacus timneh
2               Accipiter badius
3         Accipiter melanoleucus
4                Accipiter nisus
...                          ...
2046         Emberiza citrinella
2047             Emberiza cirlus
2048        Emberiza schoeniclus
2049      Emberiza melanocephala
2050           Emberiza calandra

[2051 rows x 1 columns]